###################################################################

# Created by write_sdc on Sun Dec 7 23:21:59 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_transition 0.15 [current_design]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports clk]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports reset]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports data_valid_in]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports iNTT_mode]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[127]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[126]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[125]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[124]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[123]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[122]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[121]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[120]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[119]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[118]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[117]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[116]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[115]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[114]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[113]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[112]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[111]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[110]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[109]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[108]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[107]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[106]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[105]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[104]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[103]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[102]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[101]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[100]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[99]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[98]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[97]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[96]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[95]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[94]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[93]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[92]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[91]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[90]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[89]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[88]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[87]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[86]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[85]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[84]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[83]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[82]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[81]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[80]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[79]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[78]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[77]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[76]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[75]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[74]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[73]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[72]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[71]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[70]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[69]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[68]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[67]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[66]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[65]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[64]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[63]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[62]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[61]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[60]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[59]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[58]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[57]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[56]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[55]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[54]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[53]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[52]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[51]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[50]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[49]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[48]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[47]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[46]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[45]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[44]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[43]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[42]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[41]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[40]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[39]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[38]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[37]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[36]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[35]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[34]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[33]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[32]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[31]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[30]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[29]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[28]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[27]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[26]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[25]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[24]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[23]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[22]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[21]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[20]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[19]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[18]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[17]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[16]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[15]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[14]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[13]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[12]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[11]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[10]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[9]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[8]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[7]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[6]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[5]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[4]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[3]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[2]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[1]}]
set_driving_cell -lib_cell NBUFFX4_RVT -no_design_rule [get_ports {Data_in[0]}]
set_load -pin_load 0.3 [get_ports {Data_out[127]}]
set_load -pin_load 0.3 [get_ports {Data_out[126]}]
set_load -pin_load 0.3 [get_ports {Data_out[125]}]
set_load -pin_load 0.3 [get_ports {Data_out[124]}]
set_load -pin_load 0.3 [get_ports {Data_out[123]}]
set_load -pin_load 0.3 [get_ports {Data_out[122]}]
set_load -pin_load 0.3 [get_ports {Data_out[121]}]
set_load -pin_load 0.3 [get_ports {Data_out[120]}]
set_load -pin_load 0.3 [get_ports {Data_out[119]}]
set_load -pin_load 0.3 [get_ports {Data_out[118]}]
set_load -pin_load 0.3 [get_ports {Data_out[117]}]
set_load -pin_load 0.3 [get_ports {Data_out[116]}]
set_load -pin_load 0.3 [get_ports {Data_out[115]}]
set_load -pin_load 0.3 [get_ports {Data_out[114]}]
set_load -pin_load 0.3 [get_ports {Data_out[113]}]
set_load -pin_load 0.3 [get_ports {Data_out[112]}]
set_load -pin_load 0.3 [get_ports {Data_out[111]}]
set_load -pin_load 0.3 [get_ports {Data_out[110]}]
set_load -pin_load 0.3 [get_ports {Data_out[109]}]
set_load -pin_load 0.3 [get_ports {Data_out[108]}]
set_load -pin_load 0.3 [get_ports {Data_out[107]}]
set_load -pin_load 0.3 [get_ports {Data_out[106]}]
set_load -pin_load 0.3 [get_ports {Data_out[105]}]
set_load -pin_load 0.3 [get_ports {Data_out[104]}]
set_load -pin_load 0.3 [get_ports {Data_out[103]}]
set_load -pin_load 0.3 [get_ports {Data_out[102]}]
set_load -pin_load 0.3 [get_ports {Data_out[101]}]
set_load -pin_load 0.3 [get_ports {Data_out[100]}]
set_load -pin_load 0.3 [get_ports {Data_out[99]}]
set_load -pin_load 0.3 [get_ports {Data_out[98]}]
set_load -pin_load 0.3 [get_ports {Data_out[97]}]
set_load -pin_load 0.3 [get_ports {Data_out[96]}]
set_load -pin_load 0.3 [get_ports {Data_out[95]}]
set_load -pin_load 0.3 [get_ports {Data_out[94]}]
set_load -pin_load 0.3 [get_ports {Data_out[93]}]
set_load -pin_load 0.3 [get_ports {Data_out[92]}]
set_load -pin_load 0.3 [get_ports {Data_out[91]}]
set_load -pin_load 0.3 [get_ports {Data_out[90]}]
set_load -pin_load 0.3 [get_ports {Data_out[89]}]
set_load -pin_load 0.3 [get_ports {Data_out[88]}]
set_load -pin_load 0.3 [get_ports {Data_out[87]}]
set_load -pin_load 0.3 [get_ports {Data_out[86]}]
set_load -pin_load 0.3 [get_ports {Data_out[85]}]
set_load -pin_load 0.3 [get_ports {Data_out[84]}]
set_load -pin_load 0.3 [get_ports {Data_out[83]}]
set_load -pin_load 0.3 [get_ports {Data_out[82]}]
set_load -pin_load 0.3 [get_ports {Data_out[81]}]
set_load -pin_load 0.3 [get_ports {Data_out[80]}]
set_load -pin_load 0.3 [get_ports {Data_out[79]}]
set_load -pin_load 0.3 [get_ports {Data_out[78]}]
set_load -pin_load 0.3 [get_ports {Data_out[77]}]
set_load -pin_load 0.3 [get_ports {Data_out[76]}]
set_load -pin_load 0.3 [get_ports {Data_out[75]}]
set_load -pin_load 0.3 [get_ports {Data_out[74]}]
set_load -pin_load 0.3 [get_ports {Data_out[73]}]
set_load -pin_load 0.3 [get_ports {Data_out[72]}]
set_load -pin_load 0.3 [get_ports {Data_out[71]}]
set_load -pin_load 0.3 [get_ports {Data_out[70]}]
set_load -pin_load 0.3 [get_ports {Data_out[69]}]
set_load -pin_load 0.3 [get_ports {Data_out[68]}]
set_load -pin_load 0.3 [get_ports {Data_out[67]}]
set_load -pin_load 0.3 [get_ports {Data_out[66]}]
set_load -pin_load 0.3 [get_ports {Data_out[65]}]
set_load -pin_load 0.3 [get_ports {Data_out[64]}]
set_load -pin_load 0.3 [get_ports {Data_out[63]}]
set_load -pin_load 0.3 [get_ports {Data_out[62]}]
set_load -pin_load 0.3 [get_ports {Data_out[61]}]
set_load -pin_load 0.3 [get_ports {Data_out[60]}]
set_load -pin_load 0.3 [get_ports {Data_out[59]}]
set_load -pin_load 0.3 [get_ports {Data_out[58]}]
set_load -pin_load 0.3 [get_ports {Data_out[57]}]
set_load -pin_load 0.3 [get_ports {Data_out[56]}]
set_load -pin_load 0.3 [get_ports {Data_out[55]}]
set_load -pin_load 0.3 [get_ports {Data_out[54]}]
set_load -pin_load 0.3 [get_ports {Data_out[53]}]
set_load -pin_load 0.3 [get_ports {Data_out[52]}]
set_load -pin_load 0.3 [get_ports {Data_out[51]}]
set_load -pin_load 0.3 [get_ports {Data_out[50]}]
set_load -pin_load 0.3 [get_ports {Data_out[49]}]
set_load -pin_load 0.3 [get_ports {Data_out[48]}]
set_load -pin_load 0.3 [get_ports {Data_out[47]}]
set_load -pin_load 0.3 [get_ports {Data_out[46]}]
set_load -pin_load 0.3 [get_ports {Data_out[45]}]
set_load -pin_load 0.3 [get_ports {Data_out[44]}]
set_load -pin_load 0.3 [get_ports {Data_out[43]}]
set_load -pin_load 0.3 [get_ports {Data_out[42]}]
set_load -pin_load 0.3 [get_ports {Data_out[41]}]
set_load -pin_load 0.3 [get_ports {Data_out[40]}]
set_load -pin_load 0.3 [get_ports {Data_out[39]}]
set_load -pin_load 0.3 [get_ports {Data_out[38]}]
set_load -pin_load 0.3 [get_ports {Data_out[37]}]
set_load -pin_load 0.3 [get_ports {Data_out[36]}]
set_load -pin_load 0.3 [get_ports {Data_out[35]}]
set_load -pin_load 0.3 [get_ports {Data_out[34]}]
set_load -pin_load 0.3 [get_ports {Data_out[33]}]
set_load -pin_load 0.3 [get_ports {Data_out[32]}]
set_load -pin_load 0.3 [get_ports {Data_out[31]}]
set_load -pin_load 0.3 [get_ports {Data_out[30]}]
set_load -pin_load 0.3 [get_ports {Data_out[29]}]
set_load -pin_load 0.3 [get_ports {Data_out[28]}]
set_load -pin_load 0.3 [get_ports {Data_out[27]}]
set_load -pin_load 0.3 [get_ports {Data_out[26]}]
set_load -pin_load 0.3 [get_ports {Data_out[25]}]
set_load -pin_load 0.3 [get_ports {Data_out[24]}]
set_load -pin_load 0.3 [get_ports {Data_out[23]}]
set_load -pin_load 0.3 [get_ports {Data_out[22]}]
set_load -pin_load 0.3 [get_ports {Data_out[21]}]
set_load -pin_load 0.3 [get_ports {Data_out[20]}]
set_load -pin_load 0.3 [get_ports {Data_out[19]}]
set_load -pin_load 0.3 [get_ports {Data_out[18]}]
set_load -pin_load 0.3 [get_ports {Data_out[17]}]
set_load -pin_load 0.3 [get_ports {Data_out[16]}]
set_load -pin_load 0.3 [get_ports {Data_out[15]}]
set_load -pin_load 0.3 [get_ports {Data_out[14]}]
set_load -pin_load 0.3 [get_ports {Data_out[13]}]
set_load -pin_load 0.3 [get_ports {Data_out[12]}]
set_load -pin_load 0.3 [get_ports {Data_out[11]}]
set_load -pin_load 0.3 [get_ports {Data_out[10]}]
set_load -pin_load 0.3 [get_ports {Data_out[9]}]
set_load -pin_load 0.3 [get_ports {Data_out[8]}]
set_load -pin_load 0.3 [get_ports {Data_out[7]}]
set_load -pin_load 0.3 [get_ports {Data_out[6]}]
set_load -pin_load 0.3 [get_ports {Data_out[5]}]
set_load -pin_load 0.3 [get_ports {Data_out[4]}]
set_load -pin_load 0.3 [get_ports {Data_out[3]}]
set_load -pin_load 0.3 [get_ports {Data_out[2]}]
set_load -pin_load 0.3 [get_ports {Data_out[1]}]
set_load -pin_load 0.3 [get_ports {Data_out[0]}]
set_load -pin_load 0.3 [get_ports data_valid_out]
set_load -pin_load 0.3 [get_ports mode_out]
set_max_transition 0.08 [get_ports {Data_out[127]}]
set_max_transition 0.08 [get_ports {Data_out[126]}]
set_max_transition 0.08 [get_ports {Data_out[125]}]
set_max_transition 0.08 [get_ports {Data_out[124]}]
set_max_transition 0.08 [get_ports {Data_out[123]}]
set_max_transition 0.08 [get_ports {Data_out[122]}]
set_max_transition 0.08 [get_ports {Data_out[121]}]
set_max_transition 0.08 [get_ports {Data_out[120]}]
set_max_transition 0.08 [get_ports {Data_out[119]}]
set_max_transition 0.08 [get_ports {Data_out[118]}]
set_max_transition 0.08 [get_ports {Data_out[117]}]
set_max_transition 0.08 [get_ports {Data_out[116]}]
set_max_transition 0.08 [get_ports {Data_out[115]}]
set_max_transition 0.08 [get_ports {Data_out[114]}]
set_max_transition 0.08 [get_ports {Data_out[113]}]
set_max_transition 0.08 [get_ports {Data_out[112]}]
set_max_transition 0.08 [get_ports {Data_out[111]}]
set_max_transition 0.08 [get_ports {Data_out[110]}]
set_max_transition 0.08 [get_ports {Data_out[109]}]
set_max_transition 0.08 [get_ports {Data_out[108]}]
set_max_transition 0.08 [get_ports {Data_out[107]}]
set_max_transition 0.08 [get_ports {Data_out[106]}]
set_max_transition 0.08 [get_ports {Data_out[105]}]
set_max_transition 0.08 [get_ports {Data_out[104]}]
set_max_transition 0.08 [get_ports {Data_out[103]}]
set_max_transition 0.08 [get_ports {Data_out[102]}]
set_max_transition 0.08 [get_ports {Data_out[101]}]
set_max_transition 0.08 [get_ports {Data_out[100]}]
set_max_transition 0.08 [get_ports {Data_out[99]}]
set_max_transition 0.08 [get_ports {Data_out[98]}]
set_max_transition 0.08 [get_ports {Data_out[97]}]
set_max_transition 0.08 [get_ports {Data_out[96]}]
set_max_transition 0.08 [get_ports {Data_out[95]}]
set_max_transition 0.08 [get_ports {Data_out[94]}]
set_max_transition 0.08 [get_ports {Data_out[93]}]
set_max_transition 0.08 [get_ports {Data_out[92]}]
set_max_transition 0.08 [get_ports {Data_out[91]}]
set_max_transition 0.08 [get_ports {Data_out[90]}]
set_max_transition 0.08 [get_ports {Data_out[89]}]
set_max_transition 0.08 [get_ports {Data_out[88]}]
set_max_transition 0.08 [get_ports {Data_out[87]}]
set_max_transition 0.08 [get_ports {Data_out[86]}]
set_max_transition 0.08 [get_ports {Data_out[85]}]
set_max_transition 0.08 [get_ports {Data_out[84]}]
set_max_transition 0.08 [get_ports {Data_out[83]}]
set_max_transition 0.08 [get_ports {Data_out[82]}]
set_max_transition 0.08 [get_ports {Data_out[81]}]
set_max_transition 0.08 [get_ports {Data_out[80]}]
set_max_transition 0.08 [get_ports {Data_out[79]}]
set_max_transition 0.08 [get_ports {Data_out[78]}]
set_max_transition 0.08 [get_ports {Data_out[77]}]
set_max_transition 0.08 [get_ports {Data_out[76]}]
set_max_transition 0.08 [get_ports {Data_out[75]}]
set_max_transition 0.08 [get_ports {Data_out[74]}]
set_max_transition 0.08 [get_ports {Data_out[73]}]
set_max_transition 0.08 [get_ports {Data_out[72]}]
set_max_transition 0.08 [get_ports {Data_out[71]}]
set_max_transition 0.08 [get_ports {Data_out[70]}]
set_max_transition 0.08 [get_ports {Data_out[69]}]
set_max_transition 0.08 [get_ports {Data_out[68]}]
set_max_transition 0.08 [get_ports {Data_out[67]}]
set_max_transition 0.08 [get_ports {Data_out[66]}]
set_max_transition 0.08 [get_ports {Data_out[65]}]
set_max_transition 0.08 [get_ports {Data_out[64]}]
set_max_transition 0.08 [get_ports {Data_out[63]}]
set_max_transition 0.08 [get_ports {Data_out[62]}]
set_max_transition 0.08 [get_ports {Data_out[61]}]
set_max_transition 0.08 [get_ports {Data_out[60]}]
set_max_transition 0.08 [get_ports {Data_out[59]}]
set_max_transition 0.08 [get_ports {Data_out[58]}]
set_max_transition 0.08 [get_ports {Data_out[57]}]
set_max_transition 0.08 [get_ports {Data_out[56]}]
set_max_transition 0.08 [get_ports {Data_out[55]}]
set_max_transition 0.08 [get_ports {Data_out[54]}]
set_max_transition 0.08 [get_ports {Data_out[53]}]
set_max_transition 0.08 [get_ports {Data_out[52]}]
set_max_transition 0.08 [get_ports {Data_out[51]}]
set_max_transition 0.08 [get_ports {Data_out[50]}]
set_max_transition 0.08 [get_ports {Data_out[49]}]
set_max_transition 0.08 [get_ports {Data_out[48]}]
set_max_transition 0.08 [get_ports {Data_out[47]}]
set_max_transition 0.08 [get_ports {Data_out[46]}]
set_max_transition 0.08 [get_ports {Data_out[45]}]
set_max_transition 0.08 [get_ports {Data_out[44]}]
set_max_transition 0.08 [get_ports {Data_out[43]}]
set_max_transition 0.08 [get_ports {Data_out[42]}]
set_max_transition 0.08 [get_ports {Data_out[41]}]
set_max_transition 0.08 [get_ports {Data_out[40]}]
set_max_transition 0.08 [get_ports {Data_out[39]}]
set_max_transition 0.08 [get_ports {Data_out[38]}]
set_max_transition 0.08 [get_ports {Data_out[37]}]
set_max_transition 0.08 [get_ports {Data_out[36]}]
set_max_transition 0.08 [get_ports {Data_out[35]}]
set_max_transition 0.08 [get_ports {Data_out[34]}]
set_max_transition 0.08 [get_ports {Data_out[33]}]
set_max_transition 0.08 [get_ports {Data_out[32]}]
set_max_transition 0.08 [get_ports {Data_out[31]}]
set_max_transition 0.08 [get_ports {Data_out[30]}]
set_max_transition 0.08 [get_ports {Data_out[29]}]
set_max_transition 0.08 [get_ports {Data_out[28]}]
set_max_transition 0.08 [get_ports {Data_out[27]}]
set_max_transition 0.08 [get_ports {Data_out[26]}]
set_max_transition 0.08 [get_ports {Data_out[25]}]
set_max_transition 0.08 [get_ports {Data_out[24]}]
set_max_transition 0.08 [get_ports {Data_out[23]}]
set_max_transition 0.08 [get_ports {Data_out[22]}]
set_max_transition 0.08 [get_ports {Data_out[21]}]
set_max_transition 0.08 [get_ports {Data_out[20]}]
set_max_transition 0.08 [get_ports {Data_out[19]}]
set_max_transition 0.08 [get_ports {Data_out[18]}]
set_max_transition 0.08 [get_ports {Data_out[17]}]
set_max_transition 0.08 [get_ports {Data_out[16]}]
set_max_transition 0.08 [get_ports {Data_out[15]}]
set_max_transition 0.08 [get_ports {Data_out[14]}]
set_max_transition 0.08 [get_ports {Data_out[13]}]
set_max_transition 0.08 [get_ports {Data_out[12]}]
set_max_transition 0.08 [get_ports {Data_out[11]}]
set_max_transition 0.08 [get_ports {Data_out[10]}]
set_max_transition 0.08 [get_ports {Data_out[9]}]
set_max_transition 0.08 [get_ports {Data_out[8]}]
set_max_transition 0.08 [get_ports {Data_out[7]}]
set_max_transition 0.08 [get_ports {Data_out[6]}]
set_max_transition 0.08 [get_ports {Data_out[5]}]
set_max_transition 0.08 [get_ports {Data_out[4]}]
set_max_transition 0.08 [get_ports {Data_out[3]}]
set_max_transition 0.08 [get_ports {Data_out[2]}]
set_max_transition 0.08 [get_ports {Data_out[1]}]
set_max_transition 0.08 [get_ports {Data_out[0]}]
set_max_transition 0.08 [get_ports data_valid_out]
set_max_transition 0.08 [get_ports mode_out]
create_clock [get_ports clk]  -name core_clk  -period 20  -waveform {0 10}
set_clock_latency 0.2  [get_clocks core_clk]
set_clock_uncertainty 2  [get_clocks core_clk]
set_clock_transition -max -rise 0.08 [get_clocks core_clk]
set_clock_transition -max -fall 0.08 [get_clocks core_clk]
set_clock_transition -min -rise 0.08 [get_clocks core_clk]
set_clock_transition -min -fall 0.08 [get_clocks core_clk]
group_path -name FEEDTHROUGH  -from [list [get_ports reset] [get_ports data_valid_in] [get_ports iNTT_mode] [get_ports {Data_in[127]}] [get_ports {Data_in[126]}] [get_ports {Data_in[125]}] [get_ports {Data_in[124]}] [get_ports {Data_in[123]}] [get_ports {Data_in[122]}] [get_ports {Data_in[121]}] [get_ports {Data_in[120]}] [get_ports {Data_in[119]}] [get_ports {Data_in[118]}] [get_ports {Data_in[117]}] [get_ports {Data_in[116]}] [get_ports {Data_in[115]}] [get_ports {Data_in[114]}] [get_ports {Data_in[113]}] [get_ports {Data_in[112]}] [get_ports {Data_in[111]}] [get_ports {Data_in[110]}] [get_ports {Data_in[109]}] [get_ports {Data_in[108]}] [get_ports {Data_in[107]}] [get_ports {Data_in[106]}] [get_ports {Data_in[105]}] [get_ports {Data_in[104]}] [get_ports {Data_in[103]}] [get_ports {Data_in[102]}] [get_ports {Data_in[101]}] [get_ports {Data_in[100]}] [get_ports {Data_in[99]}] [get_ports {Data_in[98]}] [get_ports {Data_in[97]}] [get_ports {Data_in[96]}] [get_ports {Data_in[95]}] [get_ports {Data_in[94]}] [get_ports {Data_in[93]}] [get_ports {Data_in[92]}] [get_ports {Data_in[91]}] [get_ports {Data_in[90]}] [get_ports {Data_in[89]}] [get_ports {Data_in[88]}] [get_ports {Data_in[87]}] [get_ports {Data_in[86]}] [get_ports {Data_in[85]}] [get_ports {Data_in[84]}] [get_ports {Data_in[83]}] [get_ports {Data_in[82]}] [get_ports {Data_in[81]}] [get_ports {Data_in[80]}] [get_ports {Data_in[79]}] [get_ports {Data_in[78]}] [get_ports {Data_in[77]}] [get_ports {Data_in[76]}] [get_ports {Data_in[75]}] [get_ports {Data_in[74]}] [get_ports {Data_in[73]}] [get_ports {Data_in[72]}] [get_ports {Data_in[71]}] [get_ports {Data_in[70]}] [get_ports {Data_in[69]}] [get_ports {Data_in[68]}] [get_ports {Data_in[67]}] [get_ports {Data_in[66]}] [get_ports {Data_in[65]}] [get_ports {Data_in[64]}] [get_ports {Data_in[63]}] [get_ports {Data_in[62]}] [get_ports {Data_in[61]}] [get_ports {Data_in[60]}] [get_ports {Data_in[59]}] [get_ports {Data_in[58]}] [get_ports {Data_in[57]}] [get_ports {Data_in[56]}] [get_ports {Data_in[55]}] [get_ports {Data_in[54]}] [get_ports {Data_in[53]}] [get_ports {Data_in[52]}] [get_ports {Data_in[51]}] [get_ports {Data_in[50]}] [get_ports {Data_in[49]}] [get_ports {Data_in[48]}] [get_ports {Data_in[47]}] [get_ports {Data_in[46]}] [get_ports {Data_in[45]}] [get_ports {Data_in[44]}] [get_ports {Data_in[43]}] [get_ports {Data_in[42]}] [get_ports {Data_in[41]}] [get_ports {Data_in[40]}] [get_ports {Data_in[39]}] [get_ports {Data_in[38]}] [get_ports {Data_in[37]}] [get_ports {Data_in[36]}] [get_ports {Data_in[35]}] [get_ports {Data_in[34]}] [get_ports {Data_in[33]}] [get_ports {Data_in[32]}] [get_ports {Data_in[31]}] [get_ports {Data_in[30]}] [get_ports {Data_in[29]}] [get_ports {Data_in[28]}] [get_ports {Data_in[27]}] [get_ports {Data_in[26]}] [get_ports {Data_in[25]}] [get_ports {Data_in[24]}] [get_ports {Data_in[23]}] [get_ports {Data_in[22]}] [get_ports {Data_in[21]}] [get_ports {Data_in[20]}] [get_ports {Data_in[19]}] [get_ports {Data_in[18]}] [get_ports {Data_in[17]}] [get_ports {Data_in[16]}] [get_ports {Data_in[15]}] [get_ports {Data_in[14]}] [get_ports {Data_in[13]}] [get_ports {Data_in[12]}] [get_ports {Data_in[11]}] [get_ports {Data_in[10]}] [get_ports {Data_in[9]}] [get_ports {Data_in[8]}] [get_ports {Data_in[7]}] [get_ports {Data_in[6]}] [get_ports {Data_in[5]}] [get_ports {Data_in[4]}] [get_ports {Data_in[3]}] [get_ports {Data_in[2]}] [get_ports {Data_in[1]}] [get_ports {Data_in[0]}]]  -to [list [get_ports {Data_out[127]}] [get_ports {Data_out[126]}] [get_ports {Data_out[125]}] [get_ports {Data_out[124]}] [get_ports {Data_out[123]}] [get_ports {Data_out[122]}] [get_ports {Data_out[121]}] [get_ports {Data_out[120]}] [get_ports {Data_out[119]}] [get_ports {Data_out[118]}] [get_ports {Data_out[117]}] [get_ports {Data_out[116]}] [get_ports {Data_out[115]}] [get_ports {Data_out[114]}] [get_ports {Data_out[113]}] [get_ports {Data_out[112]}] [get_ports {Data_out[111]}] [get_ports {Data_out[110]}] [get_ports {Data_out[109]}] [get_ports {Data_out[108]}] [get_ports {Data_out[107]}] [get_ports {Data_out[106]}] [get_ports {Data_out[105]}] [get_ports {Data_out[104]}] [get_ports {Data_out[103]}] [get_ports {Data_out[102]}] [get_ports {Data_out[101]}] [get_ports {Data_out[100]}] [get_ports {Data_out[99]}] [get_ports {Data_out[98]}] [get_ports {Data_out[97]}] [get_ports {Data_out[96]}] [get_ports {Data_out[95]}] [get_ports {Data_out[94]}] [get_ports {Data_out[93]}] [get_ports {Data_out[92]}] [get_ports {Data_out[91]}] [get_ports {Data_out[90]}] [get_ports {Data_out[89]}] [get_ports {Data_out[88]}] [get_ports {Data_out[87]}] [get_ports {Data_out[86]}] [get_ports {Data_out[85]}] [get_ports {Data_out[84]}] [get_ports {Data_out[83]}] [get_ports {Data_out[82]}] [get_ports {Data_out[81]}] [get_ports {Data_out[80]}] [get_ports {Data_out[79]}] [get_ports {Data_out[78]}] [get_ports {Data_out[77]}] [get_ports {Data_out[76]}] [get_ports {Data_out[75]}] [get_ports {Data_out[74]}] [get_ports {Data_out[73]}] [get_ports {Data_out[72]}] [get_ports {Data_out[71]}] [get_ports {Data_out[70]}] [get_ports {Data_out[69]}] [get_ports {Data_out[68]}] [get_ports {Data_out[67]}] [get_ports {Data_out[66]}] [get_ports {Data_out[65]}] [get_ports {Data_out[64]}] [get_ports {Data_out[63]}] [get_ports {Data_out[62]}] [get_ports {Data_out[61]}] [get_ports {Data_out[60]}] [get_ports {Data_out[59]}] [get_ports {Data_out[58]}] [get_ports {Data_out[57]}] [get_ports {Data_out[56]}] [get_ports {Data_out[55]}] [get_ports {Data_out[54]}] [get_ports {Data_out[53]}] [get_ports {Data_out[52]}] [get_ports {Data_out[51]}] [get_ports {Data_out[50]}] [get_ports {Data_out[49]}] [get_ports {Data_out[48]}] [get_ports {Data_out[47]}] [get_ports {Data_out[46]}] [get_ports {Data_out[45]}] [get_ports {Data_out[44]}] [get_ports {Data_out[43]}] [get_ports {Data_out[42]}] [get_ports {Data_out[41]}] [get_ports {Data_out[40]}] [get_ports {Data_out[39]}] [get_ports {Data_out[38]}] [get_ports {Data_out[37]}] [get_ports {Data_out[36]}] [get_ports {Data_out[35]}] [get_ports {Data_out[34]}] [get_ports {Data_out[33]}] [get_ports {Data_out[32]}] [get_ports {Data_out[31]}] [get_ports {Data_out[30]}] [get_ports {Data_out[29]}] [get_ports {Data_out[28]}] [get_ports {Data_out[27]}] [get_ports {Data_out[26]}] [get_ports {Data_out[25]}] [get_ports {Data_out[24]}] [get_ports {Data_out[23]}] [get_ports {Data_out[22]}] [get_ports {Data_out[21]}] [get_ports {Data_out[20]}] [get_ports {Data_out[19]}] [get_ports {Data_out[18]}] [get_ports {Data_out[17]}] [get_ports {Data_out[16]}] [get_ports {Data_out[15]}] [get_ports {Data_out[14]}] [get_ports {Data_out[13]}] [get_ports {Data_out[12]}] [get_ports {Data_out[11]}] [get_ports {Data_out[10]}] [get_ports {Data_out[9]}] [get_ports {Data_out[8]}] [get_ports {Data_out[7]}] [get_ports {Data_out[6]}] [get_ports {Data_out[5]}] [get_ports {Data_out[4]}] [get_ports {Data_out[3]}] [get_ports {Data_out[2]}] [get_ports {Data_out[1]}] [get_ports {Data_out[0]}] [get_ports data_valid_out] [get_ports mode_out]]
group_path -name REGIN  -from [list [get_ports reset] [get_ports data_valid_in] [get_ports iNTT_mode] [get_ports {Data_in[127]}] [get_ports {Data_in[126]}] [get_ports {Data_in[125]}] [get_ports {Data_in[124]}] [get_ports {Data_in[123]}] [get_ports {Data_in[122]}] [get_ports {Data_in[121]}] [get_ports {Data_in[120]}] [get_ports {Data_in[119]}] [get_ports {Data_in[118]}] [get_ports {Data_in[117]}] [get_ports {Data_in[116]}] [get_ports {Data_in[115]}] [get_ports {Data_in[114]}] [get_ports {Data_in[113]}] [get_ports {Data_in[112]}] [get_ports {Data_in[111]}] [get_ports {Data_in[110]}] [get_ports {Data_in[109]}] [get_ports {Data_in[108]}] [get_ports {Data_in[107]}] [get_ports {Data_in[106]}] [get_ports {Data_in[105]}] [get_ports {Data_in[104]}] [get_ports {Data_in[103]}] [get_ports {Data_in[102]}] [get_ports {Data_in[101]}] [get_ports {Data_in[100]}] [get_ports {Data_in[99]}] [get_ports {Data_in[98]}] [get_ports {Data_in[97]}] [get_ports {Data_in[96]}] [get_ports {Data_in[95]}] [get_ports {Data_in[94]}] [get_ports {Data_in[93]}] [get_ports {Data_in[92]}] [get_ports {Data_in[91]}] [get_ports {Data_in[90]}] [get_ports {Data_in[89]}] [get_ports {Data_in[88]}] [get_ports {Data_in[87]}] [get_ports {Data_in[86]}] [get_ports {Data_in[85]}] [get_ports {Data_in[84]}] [get_ports {Data_in[83]}] [get_ports {Data_in[82]}] [get_ports {Data_in[81]}] [get_ports {Data_in[80]}] [get_ports {Data_in[79]}] [get_ports {Data_in[78]}] [get_ports {Data_in[77]}] [get_ports {Data_in[76]}] [get_ports {Data_in[75]}] [get_ports {Data_in[74]}] [get_ports {Data_in[73]}] [get_ports {Data_in[72]}] [get_ports {Data_in[71]}] [get_ports {Data_in[70]}] [get_ports {Data_in[69]}] [get_ports {Data_in[68]}] [get_ports {Data_in[67]}] [get_ports {Data_in[66]}] [get_ports {Data_in[65]}] [get_ports {Data_in[64]}] [get_ports {Data_in[63]}] [get_ports {Data_in[62]}] [get_ports {Data_in[61]}] [get_ports {Data_in[60]}] [get_ports {Data_in[59]}] [get_ports {Data_in[58]}] [get_ports {Data_in[57]}] [get_ports {Data_in[56]}] [get_ports {Data_in[55]}] [get_ports {Data_in[54]}] [get_ports {Data_in[53]}] [get_ports {Data_in[52]}] [get_ports {Data_in[51]}] [get_ports {Data_in[50]}] [get_ports {Data_in[49]}] [get_ports {Data_in[48]}] [get_ports {Data_in[47]}] [get_ports {Data_in[46]}] [get_ports {Data_in[45]}] [get_ports {Data_in[44]}] [get_ports {Data_in[43]}] [get_ports {Data_in[42]}] [get_ports {Data_in[41]}] [get_ports {Data_in[40]}] [get_ports {Data_in[39]}] [get_ports {Data_in[38]}] [get_ports {Data_in[37]}] [get_ports {Data_in[36]}] [get_ports {Data_in[35]}] [get_ports {Data_in[34]}] [get_ports {Data_in[33]}] [get_ports {Data_in[32]}] [get_ports {Data_in[31]}] [get_ports {Data_in[30]}] [get_ports {Data_in[29]}] [get_ports {Data_in[28]}] [get_ports {Data_in[27]}] [get_ports {Data_in[26]}] [get_ports {Data_in[25]}] [get_ports {Data_in[24]}] [get_ports {Data_in[23]}] [get_ports {Data_in[22]}] [get_ports {Data_in[21]}] [get_ports {Data_in[20]}] [get_ports {Data_in[19]}] [get_ports {Data_in[18]}] [get_ports {Data_in[17]}] [get_ports {Data_in[16]}] [get_ports {Data_in[15]}] [get_ports {Data_in[14]}] [get_ports {Data_in[13]}] [get_ports {Data_in[12]}] [get_ports {Data_in[11]}] [get_ports {Data_in[10]}] [get_ports {Data_in[9]}] [get_ports {Data_in[8]}] [get_ports {Data_in[7]}] [get_ports {Data_in[6]}] [get_ports {Data_in[5]}] [get_ports {Data_in[4]}] [get_ports {Data_in[3]}] [get_ports {Data_in[2]}] [get_ports {Data_in[1]}] [get_ports {Data_in[0]}]]
group_path -name REGOUT  -to [list [get_ports {Data_out[127]}] [get_ports {Data_out[126]}] [get_ports {Data_out[125]}] [get_ports {Data_out[124]}] [get_ports {Data_out[123]}] [get_ports {Data_out[122]}] [get_ports {Data_out[121]}] [get_ports {Data_out[120]}] [get_ports {Data_out[119]}] [get_ports {Data_out[118]}] [get_ports {Data_out[117]}] [get_ports {Data_out[116]}] [get_ports {Data_out[115]}] [get_ports {Data_out[114]}] [get_ports {Data_out[113]}] [get_ports {Data_out[112]}] [get_ports {Data_out[111]}] [get_ports {Data_out[110]}] [get_ports {Data_out[109]}] [get_ports {Data_out[108]}] [get_ports {Data_out[107]}] [get_ports {Data_out[106]}] [get_ports {Data_out[105]}] [get_ports {Data_out[104]}] [get_ports {Data_out[103]}] [get_ports {Data_out[102]}] [get_ports {Data_out[101]}] [get_ports {Data_out[100]}] [get_ports {Data_out[99]}] [get_ports {Data_out[98]}] [get_ports {Data_out[97]}] [get_ports {Data_out[96]}] [get_ports {Data_out[95]}] [get_ports {Data_out[94]}] [get_ports {Data_out[93]}] [get_ports {Data_out[92]}] [get_ports {Data_out[91]}] [get_ports {Data_out[90]}] [get_ports {Data_out[89]}] [get_ports {Data_out[88]}] [get_ports {Data_out[87]}] [get_ports {Data_out[86]}] [get_ports {Data_out[85]}] [get_ports {Data_out[84]}] [get_ports {Data_out[83]}] [get_ports {Data_out[82]}] [get_ports {Data_out[81]}] [get_ports {Data_out[80]}] [get_ports {Data_out[79]}] [get_ports {Data_out[78]}] [get_ports {Data_out[77]}] [get_ports {Data_out[76]}] [get_ports {Data_out[75]}] [get_ports {Data_out[74]}] [get_ports {Data_out[73]}] [get_ports {Data_out[72]}] [get_ports {Data_out[71]}] [get_ports {Data_out[70]}] [get_ports {Data_out[69]}] [get_ports {Data_out[68]}] [get_ports {Data_out[67]}] [get_ports {Data_out[66]}] [get_ports {Data_out[65]}] [get_ports {Data_out[64]}] [get_ports {Data_out[63]}] [get_ports {Data_out[62]}] [get_ports {Data_out[61]}] [get_ports {Data_out[60]}] [get_ports {Data_out[59]}] [get_ports {Data_out[58]}] [get_ports {Data_out[57]}] [get_ports {Data_out[56]}] [get_ports {Data_out[55]}] [get_ports {Data_out[54]}] [get_ports {Data_out[53]}] [get_ports {Data_out[52]}] [get_ports {Data_out[51]}] [get_ports {Data_out[50]}] [get_ports {Data_out[49]}] [get_ports {Data_out[48]}] [get_ports {Data_out[47]}] [get_ports {Data_out[46]}] [get_ports {Data_out[45]}] [get_ports {Data_out[44]}] [get_ports {Data_out[43]}] [get_ports {Data_out[42]}] [get_ports {Data_out[41]}] [get_ports {Data_out[40]}] [get_ports {Data_out[39]}] [get_ports {Data_out[38]}] [get_ports {Data_out[37]}] [get_ports {Data_out[36]}] [get_ports {Data_out[35]}] [get_ports {Data_out[34]}] [get_ports {Data_out[33]}] [get_ports {Data_out[32]}] [get_ports {Data_out[31]}] [get_ports {Data_out[30]}] [get_ports {Data_out[29]}] [get_ports {Data_out[28]}] [get_ports {Data_out[27]}] [get_ports {Data_out[26]}] [get_ports {Data_out[25]}] [get_ports {Data_out[24]}] [get_ports {Data_out[23]}] [get_ports {Data_out[22]}] [get_ports {Data_out[21]}] [get_ports {Data_out[20]}] [get_ports {Data_out[19]}] [get_ports {Data_out[18]}] [get_ports {Data_out[17]}] [get_ports {Data_out[16]}] [get_ports {Data_out[15]}] [get_ports {Data_out[14]}] [get_ports {Data_out[13]}] [get_ports {Data_out[12]}] [get_ports {Data_out[11]}] [get_ports {Data_out[10]}] [get_ports {Data_out[9]}] [get_ports {Data_out[8]}] [get_ports {Data_out[7]}] [get_ports {Data_out[6]}] [get_ports {Data_out[5]}] [get_ports {Data_out[4]}] [get_ports {Data_out[3]}] [get_ports {Data_out[2]}] [get_ports {Data_out[1]}] [get_ports {Data_out[0]}] [get_ports data_valid_out] [get_ports mode_out]]
set_output_delay -clock core_clk  -max 6  [get_ports mode_out]
set_output_delay -clock core_clk  -min 4  [get_ports mode_out]
